[{"content":"Visualize 120 Years of Summer Olympics This data visualization project was completed by Zihui (Chris) Fang and Hongtao Hao, with Equal Contribution, as the term paper for Professor Yong-Yeol Ahn\u0026amp;rsquo;s Data Visualization course in 2019 Fall.\nThis study analyzed the historical data which contains information on athletes in all the past modern Olympic Games. We tried to answer four questions:\n How did female participation change over the years and how did these changes differ between continents? Is there a home-field advantage at the Olympics? How “efficient” is each participating country or region to get medals? and Which sports had the highest number of participants?  Results showed that both total number of athletes and the rate of female participation have been increasing in the past 120 years. Also, there seems to exist a home-field advantage. Third, medal efficiency is highly correlated with participating country or region’s economic development. Finally, athletics, gymnastics, and swimming have the highest number of athletes.\nYou can also download the PDF version of our paper, whose LaTex source code can be found here.\n","date":1508426775,"description":"","lastmod":"2019-10-26T15:26:15Z","objectID":"3976528693a0108357f4928017600865","permalink":"https://example.com/","publishdate":"2018-11-23T15:26:15Z","title":""},{"content":"From the first modern Olympics in 1896 to Rio 2016, the Summer Olympic Games has been through 120 years. This study analyzed the historical data about the Olympics and tried to answer four questions, i.e.,\n how female participation changed over the years and how these changes differed between continents, whether there is a home-field advantage at the Olympics, how \u0026amp;ldquo;efficient\u0026amp;rdquo; is each participating country and region to get medals, and which sports had the highest number of participants.  Results showed that both total number of athletes and the rate of female participation have been increasing in the past 120 years. Also, there seems to exist a home-field advantage. Third, medal efficiency is highly correlated with participating country or region\u0026amp;rsquo;s economic development. Finally, athletics, gymnastics, and swimming have the highest number of athletes.\n","date":-62135596800,"description":"","objectID":"cebb5fd823c6679bbc7e4044157ce526","permalink":"https://example.com/abstract/","title":"Abstract"},{"content":"In the following, we\u0026amp;rsquo;ll review relevant literature.\n","date":-62135596800,"description":"","objectID":"398a39707c244de497ff1d134fe7a752","permalink":"https://example.com/lit/","title":"Literature Review"},{"content":"The most straightforward way of measuring a country’s efficiency of earning medals is to count the number of medals per athlete participating. This method was used by Pettigrew and Reiche (2016) in their analysis of home-field advantage.\nSome scholars argued that when assessing the efficiency of medal production, we need to take into account the resources that countries possess, such as GDP and population. From an economics perspective, Rathke and Woitek (2007) came up with a sophisticated formula calculating this efficiency, and visualized the results using multiple box plots that were stacked horizontally. See Figure 6.\n  Figure 6: The production of Olympic Medals, 1952-2000, Rathke \u0026amp;amp; Wotiek (2007)\n  Visualizations by Eirk (2016) for the Telegraph, and those by medalspercapita.com also highlighted the importance of GDP and the size of population. For example, Eirk (2016) ranked Olympic nations based on “Gold per million people” and “Gold per £100 bn GDP”. See Figure 7 and 8.\n  Figure 7: Top 10 countries for medals per million population, Eirk (2006)\n    Figure 8: Ranking medal production considering population and GDP, Eirk (2006)\n  Similarly, using the concept of “medals per capita”, medalspercapita.com ranked countries based on “population per medal”, i.e., how many people are needed to generate a medal. They created a choropleth map based on the results where darker colors indicate lower “medals per capita”. See Table 3 and Figure 9.\n  Table 3: Population per medal\n    Figure 9: World map of population per medal\n  However, we think it is problematic to divide medal counts by population or GDP in measuring medal efficiency. First of all, this method is unfair for countries who joined the Olympics late. For example, China (PRC) attended the Olympics for the first time in 1952 and due to political issues, it was not a participant till 1984 (COC, 2004). If the total number of medals is the basis for medal efficiency, it would be unfair for countries like China …","date":-62135596800,"description":"","objectID":"a37793528276fe9cfe667f5a7c38fdfc","permalink":"https://example.com/lit/efficiency/","title":"Medal Efficiency"},{"content":"Similar to the attempt at showing female participation, simple and basic tables were utilized to examine the existence of home-field advantage at the Olympics (Pettigrew \u0026amp;amp; Reiche, 2016). See Figure 4.\n  Figure 4: Medals won by host countries at host year and the previous Olympics, Pettigrew \u0026amp;amp; Reiche (2016)\n  This visualization shows a table comparing the total number of medals earned at the host year and the previous Olympics. Changes between the two were shown in the last column. Among the 16 host countries from 1952 to 2012, only two countries showed negative changes, meaning that hosting the Olympics helped the country earn more medals. However, the problem with this method is that it is a little bit arbitrary to compare the host year and the adjacently previous Olympics. Changes might have been positive simply because these countries did not perform well only in the previous Games, even though they had performed well eight or more years before the host year. Therefore, it is a more robust choice to show these countries’ Olympic performances in all years.\nClarke (2000) did this by calculating the “Home: Away Ratio”. See Table 2.\n  Table 2: Percentage of available medals won by host countries at home and away, Clarke (2016)\n  He listed the percentage of all available medals won by countries that have ever hosted an Olympic both at the Home years and the Away years. The ratio of “Home: Away” was calculated. Obviously, a ratio larger than 1 indicates the existence of home-field advantage at the Olympics. The drawback of this method is that it only shows the summary of all the years, lacking information about these countries’ performance in each year.\nVisualizations showing all the years do exist (Grange, 2016). See Figure 5.\n  Figure 5: Visualizing home-field advantage by Grange (2006)\n  For example, in this small multiple made by R, each graph has a blue vertical line emphasizing the number of medals earned during the host year, and a red horizontal line …","date":-62135596800,"description":"","objectID":"4bee0326ce7e7996ebabcd00ace80950","permalink":"https://example.com/lit/homefiled/","title":"Home-field Advantage"},{"content":"Many attempts have already been made to visualize female participation in the Olympics. The most basic one (Bmallion, 2015) is using tables to display the information about countries with the highest and lowest percentages of female athletes, and to show female percentages across the 120 years of the Olympics. See Table 1.\n  Table 1(a): Countries with the highest rate of female participation\n    Table 1(b): Female percentage in Olympic events\n  This method is simple and informative. This is useful for researchers looking for information on this topic, but it is not effective in terms of visualization. For example, looking at the plain number won’t help viewers have a clear idea of the trend in female participation in the past 120 years.\nAnother simple but effective method is using a line graph displaying the number of female and male athletes in each Olympic Games from 1896 to 2016 (Nunes, 2019). See Figure 1.\n  Figure. 1: Evolution of the number of Olympic athletes, male and female (1986-2016), Nunes (2019)\n  This graph is successful in showing the growth in the number of female athletes. However, it fails to show the percentage change. Although viewers can see directly the increase in the total number, they might find it difficult to notice the changes in the percentage.\nWashington Street Journal did an interactive visualization comparing the inclusion of female and male events in the Olympics history (Serkez, 2018). It clearly shows that most men’s events were already established before the 1960s, whereas most women’s events were only introduced after the 1980s. See Figure 2.\n  Figure. 2: Interactive plot by Washington Post showing inclusion of male and female Olympic events\n  Each individual dot represents a sport of a gender. When clicked, there will be a line connecting to the same sport of a different gender, and information on the inclusion of this sport for both genders will appear. Overall, this visualization clearly shows how late the introduction of …","date":-62135596800,"description":"","objectID":"1aa1b4208a540ef7fcb59c66cf1235a8","permalink":"https://example.com/lit/lit-female/","title":"Female Participation in Summer Olympics"},{"content":"Dutta (2018) in his Kaggle post visualized the top 10 sports that USA excel by putting 10 boxes vertically with sports winning the most gold medals on top. See Figure 11.\n  Figure 11: Ranking of sports by weighted medals\n  This visualization is transparent and clear but the problem is that it is limited to only about 10 items, which is not enough for us to visualize all the sports in the Summer Olympics. Instead, we decided to try a bar chart and word cloud for our visualizations.\n","date":-62135596800,"description":"","objectID":"c91bab34f16acf3f689eddf91d192988","permalink":"https://example.com/lit/ranking/","title":"Ranking Sports by Number of Athletes"},{"content":"The modern Olympic Games are the greatest sports mega-event in the world (Grix, 2013). It generates a massive number of audiences worldwide. The latest Rio 2016 Olympics, for example, attracted 3.5 billion viewers (Roxbourough, 2016), half of the world population. Apart from this mobilizing power, the Olympic Games have significant political (Giulianotii, 2015; Cottrell \u0026amp;amp; Nelson, 2010; MacAloon, 1995), economic (Madden, 2002; Blake, 2005; Osada, Ojima, Kurachi, Miura, \u0026amp;amp; Kawamoto, 2016), and socio-cultural (Malfas, Theodoraki, \u0026amp;amp; Houlihan, 2004) impacts. It also contributes to global friendship and cooperation (Beutler, 2008).\nGender equality in sports has been a hot topic (Mervosh \u0026amp;amp; Caron, 2019). Debates on this issue have revolved around equal pay and media coverage (Baker, Seymour, \u0026amp;amp; Zimbalist, 2019). There has long been an obvious gender pay gap in sports (Abrams, 2019; Farmer, 2017). For example, of the 100 athletes on the 2019 Forbes list of the world’s highest-paid athletes, only one of them is a woman. i.e., Serena Williams, who is ranked 63th on the list. There has also been a lack of media coverage on women in sports. Although 40% of all sports participants are female, only 4% of the sports media coverage were about female athletes (MacKenzie, 2019). A study (Cooky, Messner, \u0026amp;amp; Musto, 2015) examining sports coverage from 1989 to 2014 found that despite a dramatic increase in the number of women playing sports (Good, 2015), there had been a decrease in the amount of coverage of female athletes. Under this backdrop, we aim to look at female participation across the globe in the Summer Olympic Games of the past 120 years.\nRecently, there has been a trend that fewer cities want to host the Olympics, challenging the future of a century-old tradition (Goldblatt, 2016). For example, 12 cities bid for 2004 Summer Olympics but only two for the 2020 Winter games (Ludacer, 2018). Considering the importance of Olympic success in national pride …","date":-62135596800,"description":"","objectID":"20c810a2b5cbbbafc1cc0a02718ea51a","permalink":"https://example.com/motivation/","title":"Motivation"},{"content":"As discussed above, we will use a line graph, stacked bar chart, and area chart to show the overall trend of female participation in the Summer Olympics. For female participation in each individual continent, we will use KDE in a small multiple.\nIn a line graph, the x-axis will be time and the y-axis the percentage against the total number of participants. We will show both female and male athletes. See Figure 12.\nFor stacked bar charts, the x-axis will be time and y-axis percentage against the total number of athletes. Two segments in each bar will represent male and female respectively, and the two will sum up to 100% for every year presented. This will make the comparison between male and female participation very clear. See Figure 13.\n  Figure 12: Line graph for female participation\n    Figure 13: Stacked bar chart for female participation\n  In order to also show the changes in the total number of athletes, beside the changes in percentages, we will use a stacked area chart. The x-axis will be again time, and the y-axis will be the total number of athletes for each Olympic Games. See Figure 14.\nFor female participation in each individual continent over the years, we will line graphs in a small multiple. The x-axis will be time and the y-axis will be the percentage of female athletes against the total number of athletes. To make comparisons between continents and with the global average clearer, for each plot in the small multiple, we will put the line graph of other continents in the background, and we will also plot the global average as the benchmark. See Figure 15.\n  Figure 14: Staked area chart for female participation\n    Figure 15: Line graph in small multiple for female participation\n  ","date":-62135596800,"description":"","objectID":"9081b5a755ef2113ad303594f3b1811b","permalink":"https://example.com/plans/01-plan-female/","title":"Plans: Female Participation"},{"content":"To examine whether there exists a home-field advantage at the Olympics, we will first use a scatter plot with jitter. The x-axis will be countries that have ever been a host, and the y-axis will be the percentage against the total number of medals a country earned. Each dot represents an Olympic Games the country has participated in. Black dots denote data for a “non-host” year and orange dots denote data for host year. See Figure 16.\nTo better show the density distribution of medal gains, we will employ kernel density estimation in a small multiple. The x-axis will be the percentage against the total number of medals at a Games and the y-axis will be density. We will use an arrow to denote the density of a year when the country was a host. See Figure 17.\nArrows located at points with high densities, would be signs of the existence of home-field advantage at the Olympics.\n  Figure 16: Scatter plot with jittering for home-field advantage\n    Figure 17: KDE for home-field advantage\n  ","date":-62135596800,"description":"","objectID":"734c6db3f5050cdef6ba4b6bf95702e2","permalink":"https://example.com/plans/02-plan-homefiled/","title":"Plans: Home-field Advantage"},{"content":"The index of “medal efficiency” will be calculated as medal points per athlete participating. We will use an interactive choropleth world map to show each participating country and region’s score. See Figure 18.\n  Figure 18: Choropleth map for medal efficiency\n  ","date":-62135596800,"description":"","objectID":"b43461f398e8c7b7bf320b96e54efbab","permalink":"https://example.com/plans/03-plan-efficiency/","title":"Plan: Medal Efficiency"},{"content":"First, we will use a bar chart where the x-axis will be the different sports and the y-axis the corresponding number of athletes. See Figure 19.\nSecond, we will show this ranking using a word cloud in which larger font size denotes a higher number of participants. This graph will be clearer and more direct because viewers can intuitively get a sense of the relative size of participation of a sport. See Figure 20.\n  Figure 19: Bar chart for sports ranking\n    Figure 20: Word cloud for sports ranking\n  ","date":-62135596800,"description":"","objectID":"0c32ea53c56a53c10f6a4fbfd62b7247","permalink":"https://example.com/plans/04-plan-ranking/","title":"Plans: Ranking Sports"},{"content":"In the following, we\u0026amp;rsquo;ll detail our plans for making visualizations.\n","date":-62135596800,"description":"","objectID":"dba7537cb703df7c705b818a6278b51f","permalink":"https://example.com/plans/","title":"Visualization Plans"},{"content":"To visualize changes in female participation in each continent, we first used a simple line graph where we put all the continent together. The x-axis is time, and the y-axis is female participation. The legend shows the colors associated with the continents. See Figure 25.\n  Figure 25: Line graph for female participation by continent\n  The graph was very messy. As there were six continents and one global average, we could not distinguish between the seven categories very easily. So we gave up this option.\nThen we tried a small multiple in which each continent and the global average were shown in simple line graphs. This chart showed every continent clearly but it was not very easy to make a comparison. See Figure 26.\n  Figure 26: Line graph in small multiple for female participation by continent\n  To make comparisons clearer, we decided to use an area chart. We stacked each area chart each representing a continent along a vertical line. However, comparisons were still difficult. Most importantly, in terms of using color as the visual encoding, this graph has too many categories. Besides, it has red and green at the same time, and therefore is not accessible to colorblind populations. See Figure 27.\n  Figure 27: Stacked bar chart for female participation by continent\n  We then went back to the small multiple. Since we cared about the comparison between each continent, we decided to plot every continent and the global average in each of the six graphs. We highlighted only one continent in each graph, and set all other continents grey in the background. It worked much better than out earlier attempts, but one drawback is that it did not allow comparison with the global average. See Figure 28.\n Figure 28: Line graph in small multiple for female participation by continent against all other groups\n  Finally, we decided to highlight the global average with a black line. This time, comparisons both between continents and with the global average were clear. See Figure 29. …","date":-62135596800,"description":"","objectID":"1b1a3fcbafd8113f237075085702123b","permalink":"https://example.com/plot/01-plot-female-continent/","title":"Female Participation Across Continents"},{"content":"As planned above, we started with a simple line graph displaying both male and female athletes’ percentage against all athletes. The strength of this method is that it is simple and clear. It shows that the female percentage has been steadily growing in the past century at the Olympics. The drawback is that it does not generate a stark contrast between male and female as a stacked bar chart can do. See Figure 21.\n  Figure 21: Line graph for changes in female participation\n  We then used stacked bar graphs. We first tried stacking the bar horizontally with percentage on the x-axis and time on y-axis. See Figure 22.\n  Figure 22: Horizontal stacked bar chart for changes in female participation\n  It was not as beautiful as we wanted, so we tried to put it upright and replace the axis labels. To highlight the trend, we set the male section grey and the female part bright blue. We also drew a red line at the intersection of the two parts. This time, female participation was obviously highlighted and the trend shown very clearly. See Figure 23.\n  Figure 23: Vertical stacked bar chart for changes in female participation\n  However, as discussed above, stacked bar charts can only show the changes in percentages, not those in the actual number of participants. To also visualize how the total number of athletes participating in the Olympics changed over the century, we opted for a stacked area chart. See Figure 24.\n  Figure 24: Stacked area chart for changes in female participation\n  The x-axis denotes time and the y-axis number of athletes. Areas are made up of male and female participants. The two added up to the total number of athletes. This stacked area chart not only shows the changes in female participation, it also displays how the total number of athletes has been increasing over the years. The drawback is that area is not a much preferred visual encoding. As a result, the comparison of percentages of male and female is not very accurate. That said, we think its …","date":-62135596800,"description":"","objectID":"a8dcfdd1968de2660bbfbfa4fcd96b0e","permalink":"https://example.com/plot/01-plot-female/","title":"Female Participation over Time"},{"content":"As discussed above, we first tried scatter plot with jitter. The x-axis is the countries that have ever hosted the Olympics and the y-axis denotes the percentage of medals earned by a country against the total number of medals in that year. Blue dots represent data when the country was not the host and the orange ones for when it was the host. See Figure 30.\n Figure30: Scatter plot with jittering for home-field advantage\n  The blue dots were too packed. We later tried beeswarm plot coupled with box plot. Dots were shown much more clearly but one drawback is that we could not see the density distribution of all the dots very well. Density distribution was important in this case because it would allow an easier comparison between the medal percentage when a country was a host and that when it was not. See Figure 31.\n Figure 31: Beeswarm plot for home-field advantage\n  To show density distribution of medal percentages, we used kernel density estimation in a small multiple. The x-axis is the medal percentage and the y-axis is the probability density. We used a red arrow to denote when the country was an Olympics host. An arrow located at the tail would indicate the existence of home-field advantage. See Figure 32.\n  Figure 32: KDE in small multiple for home-field advantage\n  ","date":-62135596800,"description":"","objectID":"879791d55d4a60d9d50220d0300c6671","permalink":"https://example.com/plot/02-plot-homefiled/","title":"Home-field Advantage"},{"content":"As planned, first of all, we did data manipulation before plotting. Golds were given 4 points, Silver 2, and Bronze 1. Attendance without any medals was assigned to 0 point. A country’s “medal efficiency” was calculated as the quotient of total medal points and the total number of athletes participating over 120 years. Therefore, if a country / region has a medal efficiency of 0.5, it means that on average, each athlete of that country / region earned half a Bronze.\nWe then plotted a choropleth map using orthographic projection. We applied Viridis color map where darker shades denote higher medal efficiency. To ensure interactivity, we made this map with the Plotly package. See Figure 33.\n Figure 33: Interactive choropleth for medal efficiency\n  We found this index both more accurate and intuitive. The reasons why it is more accurate have been outlined above. We believe that it is also more intuitive because, for example, for countries that still exist today, the highest medal efficiency is 0.91 for the United States of America. The fact that the highest is close to one makes it easier to compare between countries.\n","date":-62135596800,"description":"","objectID":"d67b6eea310a9bbd331078ed1eb4781e","permalink":"https://example.com/plot/03-plot-efficiency/","title":"Medal Efficiency"},{"content":"To rank sports according to the number of athletes, we first plotted a bar chart, each bar representing a category. As can be seen below, since there were too many categories, the names of sports overlapped to a degree that most of them were indistinguishable. Since there are around thirty sports, using colors is not an ideal option.\nWe then thought about the word cloud. In word clouds, the size of words is associated with the frequencies. This would make our ranking clearer. We did this visualization with the wordcloud package. See Figure 34.\n Figure 34: Word cloud of sports ranking by number of participants in all past Summer Olympics\n  ","date":-62135596800,"description":"","objectID":"79ac85e380bc3868a9e435013d88c9b7","permalink":"https://example.com/plot/04-plot-ranking/","title":"Ranking Sports"},{"content":"In the following, we\u0026amp;rsquo;ll show final plots based on our plans.\n","date":-62135596800,"description":"","objectID":"0eec2a45f25af84a14a9bd24f8c23af7","permalink":"https://example.com/plot/","title":"Plotting"},{"content":"Research Question Recap This paper answered four major questions:\n How does female participation at the Olympics, both overall and in each continent, change over time? Is there a home-field advantage at the Olympics? What is the medal efficiency for each country and region? Which sports have the highest number of participating athletes at the Olympics?  Major Findings Our visualizations demonstrated that:\n  Both the total number of participating athletes and the percentage of female athletes in the Olympics has been increasing. Female participation started from 0% in Athens 1896 to 45% in Rio 2016.\n  However, this growth in the rate of participation of women varies across continents. The rate in Africa has always been lower than the global average except for during the 1930s. The rate in Asia and South America had also been always lower than the global average but caught up during the 1980s and 2000s, respectively. The rate in Europe, North America and Oceania has always been the same as or higher than the global mean.\n  A country is more likely to have a higher degree of medal share when it hosts the Olympics. In other words, home-field advantage does seem to exist in the Olympics.\n  Among today’s countries and regions, the United States of America has the highest medal efficiency, 0.91. This means that on average, every American athlete almost earned a Bronze medal in the past Olympic Games. Medal efficiency for Russia, China, Pakistan, India, Germany, and Australia is also very high. We also found that medal efficiency had a high correlation with countries\u0026amp;rsquo; economic development.\n  Athletics, gymnastics, swimming, shooting and football are among the sports with the highest number of participating athletes. This might be because these sports have greater shares of total medals. It might also because there are many sub-categories within them.\n  Reflections \u0026amp;amp; Future Work First, when visualizing changes in female participation, we found that stacked bar …","date":-62135596800,"description":"","objectID":"682c526b11aa9eba41db4906258e7416","permalink":"https://example.com/z-conclude/","title":"Conclusion"},{"content":"Abrams, O. (2019, June 23). Why Female Athletes Earn Less Than Men Across Most Sports. Retrieved from https://www.forbes.com/sites/oliviaabrams/2019/06/23/why-female-athletes-earn-less-than-men-across-most-sports/#646f8eeb40fb.\nBaker, C. N., Seymour, E., \u0026amp;amp;Zimbalist, A. (2019, April 18). Less Money, Less Media: How Female Athletes are Undervalued. Retrieved from https://msmagazine.com/2019/04/18/less-money-less-media-how-female-athletes-are-undervalued/.\nBian, X. (2005). Predicting Olympic medal counts: The effects of economic development on Olympic performance. The park place economist, 13(1), 37-44.\nBeutler, I. (2008). Sport serving development and peace: Achieving the goals of the United Nations through sport. Sport in society, 11(4), 359-369.\nBernard, A. B., \u0026amp;amp; Busse, M. R. (2004). Who wins the Olympic Games: Economic resources and medal totals. Review of economics and statistics, 86(1), 413-417.\nCOC. (2014, March 27). 10th-15th Olympic Games: 1936-1952. Retrieved from http://en.olympic.cn/games/summer/2004-03-27/121663.html.\nCooky, C., Messner, M. A., \u0026amp;amp; Musto, M. (2015). “It’s dude time!” A quarter century of excluding women’s sports in televised news and highlight shows. Communication \u0026amp;amp; Sport, 3(3), 261-287.\nCottrell, M. P., \u0026amp;amp; Nelson, T. (2011). Not just the Games? Power, protest and politics at the Olympics. European Journal of International Relations, 17(4), 729-753.\nDarnell, S. C. (2012). Olympism in action, Olympic hosting and the politics of ‘sport for development and peace’: Investigating the development discourses of Rio 2016. Sport in Society, 15(6), 869-887.\nDutta, D. (2018). Analysing the Olympics (for last 120 yrs.). Retrieved from https://www.kaggle.com/duttadebadri/analysing-the-olympics-for-last-120-yrs.\nFarmer, I. (2017, December 18). Why are female athletes paid less than male athletes? Retrieved from https://news.jrn.msu.edu/2017/12/why-are-female-athletes-paid-less-than-male-athletes/.\nForbes (2019). World\u0026amp;rsquo;s Highest …","date":-62135596800,"description":"","objectID":"3559ca12e5abb924d40fe29ce6fe3d84","permalink":"https://example.com/z-ref/","title":"References"}]